In [1]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame

In [3]:
dframe = DataFrame({'key1':['A']*2+['B']*3,
                 'key2':[1,1,2,2,2]})
dframe

  key1  key2
0    A     1
1    A     1
2    B     2
3    B     2
4    B     2

In [5]:
dframe.duplicated()

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [7]:
dframe.drop_duplicates()

  key1  key2
0    A     1
2    B     2

In [9]:
# dropping the duplicates in a specific column
dframe.drop_duplicates('key1')

  key1  key2
0    A     1
2    B     2

In [17]:
dframe.drop_duplicates(['key2'],keep='last')

  key1  key2
1    A     1
4    B     2